{
    "tone": "Mischievous",
    "promptText": "Here is the resume converted into plain text:\n\nJin Hong Kuan (612) 860 8454\nhttps://jinhongkuan.github.io/portfolio/ kuan0019@umn.edu\nLanguages: Solidity Python Javascript C++ Rust\nTechnologies: React (Native & js) web3.js TensorFlow\n\nEducation\nB.S. Computer Science (Honors), Math Minor, University of Minnesota – Twin Cities\nTechnical GPA: 3.96/4.00 | Expected Graduation: May 2022\nActivities: UMN Blockchain Club (Founder and President) | Award: Dean's List\n\nExperience\nUndergraduate Researcher July 2021 – Sept 2021\nSanta Fe Institute, NM (Remote)\n\nSummer REU in Complexity Science. Applied ML (Tensorflow) to infer the stochastic dynamics guiding the development of human societies based on the Seshat Databank.\nMentored by Dr. David Wolpert and Dr. Hajime Shimao.\nSummer Software Engineering Intern June 2020 – Sept 2020\nCollins Aerospace, IA (Remote)\n\nDeveloped testing software for Avionics equipments, in C, Python and Ansible.\nCollaborated with DevOps team through daily remote meetings under Agile framework.\nProjects\nOpenLabs Aug 2021\n\nHackFS entry. DAO-based platform for scholarly research, utilizing decentralized file storage and token rewards to promote open science.\nCeramic, Chainlink and Protocol Labs pool prize winner. [site | github]\nKeylinq June 2021\n\nDecentralized finance (DeFi) application enabling safe payments for freelancers using smart contracts. Live on Binance Smart Chain.\nPersonal project. Full-stack development with Solidity, web3.js, ReactJs, and IPFS. [site | github]\nMinneMUDAC Nov 2019\n\nStudent data science challenge. Performed multivariate timeseries forecasting using recurrent neural nets on Tensorflow to predict soybean prices.\nTeaching\nDepartment of Computer Science and Engineering, University of Minnesota, MN Jan 2020 – May 2020\n\nCSCI 1113: Introduction to C/C++ Programming for Scientists and Engineers\nCSCI 1115: Companion Course for CSCI 1113\nPublication\nEmergence and Stability of Self-Evolved Cooperative Strategies using Stochastic Machine\nJin Hong Kuan, Aadesh Salecha\nIEEE Symposium Series on Computational Intelligence, 2020 [paper | github | slides]\n\nSource Separation and Depthwise Separable Convolutions for Computer Audition\nGabriel Mersy, Jin Hong Kuan\n\nAAAI Conference on Artificial Intelligence, 2021 Student Abstract and Poster Program [paper]\n\nAn Empirical Study of Communication-Free Coordination in Human-Robot Teams Through a Coverage Control Game\nJin Hong Kuan, A. Yasin Yazıcıoğlu, Derya Aksaray\nUniversity of Minnesota Undergraduate Research Opportunity Program [paper | github]\n"
}
